## Production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.expired-inflight-critical`      |
|        | `aws_cloudwatch_metric_alarm.expired-inflight-warning`       |
| delete | `aws_cloudwatch_metric_alarm.expired-email-created-critical` |
|        | `aws_cloudwatch_metric_alarm.expired-email-created-warning`  |
|        | `aws_cloudwatch_metric_alarm.expired-sms-created-critical`   |
|        | `aws_cloudwatch_metric_alarm.expired-sms-created-warning`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.expired-email-created-critical will be destroyed
  # (because aws_cloudwatch_metric_alarm.expired-email-created-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "expired-email-created-critical" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - alarm_description         = "Email inflights are expiring at > 200 for 5 minutes" -> null
      - alarm_name                = "expired-email-created-critical" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:expired-email-created-critical" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "expired-email-created-critical" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 200 -> null
      - treat_missing_data        = "notBreaching" -> null

      - metric_query {
          - id          = "expired_email_created" -> null
          - label       = "Expired email created" -> null
          - period      = 0 -> null
          - return_data = true -> null

          - metric {
              - dimensions  = {
                  - "expired"           = "True"
                  - "notification_type" = "email"
                } -> null
              - metric_name = "batch_saving_inflight" -> null
              - namespace   = "NotificationCanadaCa" -> null
              - period      = 300 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-email-created-warning will be destroyed
  # (because aws_cloudwatch_metric_alarm.expired-email-created-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "expired-email-created-warning" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - alarm_description         = "Email inflights are expiring at > 100 for 5 minutes" -> null
      - alarm_name                = "expired-email-created-warning" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:expired-email-created-warning" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "expired-email-created-warning" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 100 -> null
      - treat_missing_data        = "notBreaching" -> null

      - metric_query {
          - id          = "expired_email_created" -> null
          - label       = "Expired Email created" -> null
          - period      = 0 -> null
          - return_data = true -> null

          - metric {
              - dimensions  = {
                  - "expired"           = "True"
                  - "notification_type" = "email"
                } -> null
              - metric_name = "batch_saving_inflight" -> null
              - namespace   = "NotificationCanadaCa" -> null
              - period      = 300 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-inflight-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "expired-inflight-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "More than 10 inflights expired in 5 minutes, check the Redis-batch-saving dashboard"
      + alarm_name                            = "expired-inflight-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "expired_inflights_5_minutes"
          + label       = "Expired inflights in 5 minutes"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "expired"           = "True"
                  + "notification_type" = "any"
                  + "priority"          = "any"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-inflight-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "expired-inflight-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "An inflight has expired. Check the Redis-batch-saving dashboard"
      + alarm_name                            = "expired-inflight-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "expired_inflights_1_minute"
          + label       = "Expired inflights in one minute"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "expired"           = "True"
                  + "notification_type" = "any"
                  + "priority"          = "any"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 60
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-sms-created-critical will be destroyed
  # (because aws_cloudwatch_metric_alarm.expired-sms-created-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "expired-sms-created-critical" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - alarm_description         = "SMS inflights are expiring at > 200 for 5 minutes" -> null
      - alarm_name                = "expired-sms-created-critical" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:expired-sms-created-critical" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "expired-sms-created-critical" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 200 -> null
      - treat_missing_data        = "notBreaching" -> null

      - metric_query {
          - id          = "expired_sms_created" -> null
          - label       = "Expired SMS created" -> null
          - period      = 0 -> null
          - return_data = true -> null

          - metric {
              - dimensions  = {
                  - "expired"           = "True"
                  - "notification_type" = "sms"
                } -> null
              - metric_name = "batch_saving_inflight" -> null
              - namespace   = "NotificationCanadaCa" -> null
              - period      = 300 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-sms-created-warning will be destroyed
  # (because aws_cloudwatch_metric_alarm.expired-sms-created-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "expired-sms-created-warning" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - alarm_description         = "SMS inflights are expiring at > 100 for 5 minutes" -> null
      - alarm_name                = "expired-sms-created-warning" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:expired-sms-created-warning" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "expired-sms-created-warning" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 100 -> null
      - treat_missing_data        = "notBreaching" -> null

      - metric_query {
          - id          = "expired_sms_created" -> null
          - label       = "Expired SMS created" -> null
          - period      = 0 -> null
          - return_data = true -> null

          - metric {
              - dimensions  = {
                  - "expired"           = "True"
                  - "notification_type" = "sms"
                } -> null
              - metric_name = "batch_saving_inflight" -> null
              - namespace   = "NotificationCanadaCa" -> null
              - period      = 300 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
    }

Plan: 2 to add, 0 to change, 4 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 59 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
